# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [1]:
import pandas as pd
import numpy as np

In [2]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [41]:
np.random.seed(1)

df = pd.DataFrame(np.random.randn(4,4)* 4 + 3)

df
#normalized_df=(df-df.min())/(df.max()-df.min())

          0         1         2         3
0  9.497381  0.552974  0.887313 -1.291874
1  6.461631 -6.206155  9.979247 -0.044828
2  4.276156  2.002518  8.848432 -5.240563
3  1.710331  1.463783  7.535078 -1.399565

In [116]:
#df.describe()

              0         1         2         3
count  4.000000  4.000000  4.000000  4.000000
mean   5.486375 -0.546720  6.812517 -1.994207
std    3.304665  3.820090  4.074443  2.249872
min    1.710331 -6.206155  0.887313 -5.240563
25%    3.634700 -1.136808  5.873137 -2.359815
50%    5.368893  1.008378  8.191755 -1.345720
75%    7.220568  1.598467  9.131136 -0.980113
max    9.497381  2.002518  9.979247 -0.044828

In [117]:
#normalized_df=(df-df.min())/(df.max()-df.min())

In [118]:
#normalized_df

          0         1         2         3
0  1.000000  0.823413  0.000000  0.759986
1  0.610154  0.000000  1.000000  1.000000
2  0.329499  1.000000  0.875624  0.000000
3  0.000000  0.934370  0.731172  0.739260

In [122]:
#from sklearn import preprocessing
#min_max = preprocessing.MinMaxScaler() 
#res_transformacao = min_max.fit_transform(df) 
#df_normalizado = pd.DataFrame(res_transformacao) 
#df_normalizado

          0         1         2         3
0  1.000000  0.823413  0.000000  0.759986
1  0.610154  0.000000  1.000000  1.000000
2  0.329499  1.000000  0.875624  0.000000
3  0.000000  0.934370  0.731172  0.739260

In [123]:
#from sklearn import preprocessing
#coluna_purchase = black_friday['Purchase'] #primeiro peguei so a colna purchase
#df = pd.DataFrame(coluna_purchase) #transformando a tabelinha em dataframe
#min_max = preprocessing.MinMaxScaler() #processamento do minemax
#res_transformacao = min_max.fit_transform(df) # transformacao dos dados da coluna purchase pro minemax da formula la, isos gera um vetor ja com resultado
#res_transformacao

array([[0.34425471],
       [0.63151918],
       [0.05202725],
       ...,
       [0.33050135],
       [0.29386777],
       [0.28137618]])

In [126]:
#coluna_purchase_normalizada = pd.DataFrame(res_transformacao) #trsnformacao do vetor de antes em dtframe
#float(coluna_purchase_normalizada.mean()) #retorna a media dos valores da coluna, depois de normalizado

0.38479390362696736

In [124]:

#coluna_purchase = black_friday['Purchase'] #primeiro peguei so a colna purchase
#df = pd.DataFrame(coluna_purchase) #transformando a tabelinha em dataframe
#fonte https://www.it-swarm.dev/pt/python/normalize-colunas-do-dataframe-do-pandas/1049023341/
#normalized_df=(df-df.min())/(df.max()-df.min())
#float(normalized_df.mean())
#float(coluna_purchase_normalizada.mean()) #retorna a media dos valores da coluna, depois de normalizado

        Purchase
0       0.344255
1       0.631519
2       0.052027
3       0.036676
4       0.327389
...          ...
537572  0.482798
537573  0.799588
537574  0.330501
537575  0.293868
537576  0.281376

[537577 rows x 1 columns]

In [127]:
#float(normalized_df.mean())

0.38479390362696736

In [128]:
black_friday.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.375770e+05,537577.00000,537577.000000,537577.000000,370591.000000,164278.000000,537577.000000
mean,1.002992e+06,8.08271,0.408797,5.295546,9.842144,12.669840,9333.859853
std,1.714393e+03,6.52412,0.491612,3.750701,5.087259,4.124341,4981.022133
min,1.000001e+06,0.00000,0.000000,1.000000,2.000000,3.000000,185.000000
25%,1.001495e+06,2.00000,0.000000,1.000000,5.000000,9.000000,5866.000000
50%,1.003031e+06,7.00000,0.000000,5.000000,9.000000,14.000000,8062.000000
75%,1.004417e+06,14.00000,1.000000,8.000000,15.000000,16.000000,12073.000000
max,1.006040e+06,20.00000,1.000000,18.000000,18.000000,18.000000,23961.000000

In [7]:
test = black_friday.head(5)
#Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.
test

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [154]:
test.nunique()

User_ID                       2
Product_ID                    5
Gender                        2
Age                           2
Occupation                    2
City_Category                 2
Stay_In_Current_City_Years    2
Marital_Status                1
Product_Category_1            4
Product_Category_2            2
Product_Category_3            1
Purchase                      5
dtype: int64

In [153]:
test.isnull().nunique()

User_ID                       1
Product_ID                    1
Gender                        1
Age                           1
Occupation                    1
City_Category                 1
Stay_In_Current_City_Years    1
Marital_Status                1
Product_Category_1            1
Product_Category_2            2
Product_Category_3            2
Purchase                      1
dtype: int64

In [40]:
#test.info()
#test.count
test.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.000000e+00,5.000000,5.0,5.000000,2.000000,1.0,5.000000
mean,1.000001e+06,11.200000,0.0,7.200000,10.000000,14.0,6803.600000
std,4.472136e-01,2.683282,0.0,5.069517,5.656854,NaN,5837.300943
min,1.000001e+06,10.000000,0.0,1.000000,6.000000,14.0,1057.000000
25%,1.000001e+06,10.000000,0.0,3.000000,8.000000,14.0,1422.000000
50%,1.000001e+06,10.000000,0.0,8.000000,10.000000,14.0,7969.000000
75%,1.000001e+06,10.000000,0.0,12.000000,12.000000,14.0,8370.000000
max,1.000002e+06,16.000000,0.0,12.000000,14.000000,14.0,15200.000000

In [22]:
#
black_friday.dtypes.nunique()
#black_friday.nunique()

3

In [78]:
black_friday.describe().iloc[[0][0]]#.sum()

User_ID               537577.0
Occupation            537577.0
Marital_Status        537577.0
Product_Category_1    537577.0
Product_Category_2    370591.0
Product_Category_3    164278.0
Purchase              537577.0
Name: count, dtype: float64

In [76]:
black_friday.isnull().sum().sum()

540285

In [71]:
black_friday.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [79]:
black_friday.shape[0]*black_friday.shape[1]

6450924

In [5]:
product_2 = black_friday['Product_Category_2'].isnull() #verificando os valores null da coluna produto categoria 2
product_3 = black_friday['Product_Category_3'].isnull() #verificando os valores  null da coluna produto categoria 3
product_3.equals(product_2) #retornando o resultado da comparaçao entre as duas colunas

False

In [4]:
product_2

0          True
1         False
2          True
3         False
4          True
          ...
537572    False
537573    False
537574    False
537575     True
537576    False
Name: Product_Category_2, Length: 537577, dtype: bool

In [161]:
from numpy.random import randn
df = pd.DataFrame(randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],
               columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

df

#sum(df.isnull().values.ravel())

#percent_ind = black_friday.isnull().sum()/black_friday.shape[0] # esse comando filtra a soma da qtd de null e depois divide pela quantidade total 
#percent = percent_ind.sum()/12 #com resultado da porcentagem individual foi divido por 12 porque sao 12 colunas

        one       two     three
a  0.185156 -0.375285 -0.638730
b       NaN       NaN       NaN
c  0.423494  0.077340 -0.343854
d       NaN       NaN       NaN
e  0.043597 -0.620001  0.698032
f -0.447129  1.224508  0.403492
g       NaN       NaN       NaN
h  0.593579 -1.094912  0.169382

In [ ]:
product_2 = black_friday['Product_Category_2'].isnull() #verificando os valores null da coluna produto categoria 2
product_3 = black_friday['Product_Category_3'].isnull() #verificando os valores  null da coluna produto categoria 3
product_2.equals(product_3) #retornando o resultado da comparaçao entre as duas colunas

In [178]:

df.isnull().sum()/df.shape[0]

one      0.375
two      0.375
three    0.375
dtype: float64

In [163]:
sum(df.isnull().values.ravel())

9

In [59]:
test2 = pd.DataFrame({
        "Name": ["Braund, Mr. Owen Harris",
                 "NaN",
                 "Bonnell, Miss. Elizabeth"],
        "Age": [22, 35, 58],
        "Sex": ["male", "NaN","female"]})

In [66]:
test2.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [80]:
total_reg = black_friday.shape[0]*black_friday.shape[1] #total de registros = qtd linhas*qtd colunas
total_null = black_friday.isnull().sum().sum() #total de registros null
percent = (total_null*100)/total_reg #regra de 3
float(percent/100) #aki divido por 100 pra ficar entre 0 e 1

0.0837531181579569

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [34]:
def q1():
    # Retorne aqui o resultado da questão 1.
    #aki tbm podia se so ... black_friday.shape
    t = (black_friday.shape[0], black_friday.shape[1])
    return t
    pass

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [31]:
def q2():
    # Retorne aqui o resultado da questão 2.
    aux = black_friday[['Gender','Age']] #primeiro montei uma tbl aux so com as colunas necessarias
    mulheres = aux.loc[aux['Gender']=='F'] #depois filtrei so os dados onde a coluna genero é igual a F
    cont = mulheres['Age'].value_counts() #depois contei a qtd de tds  as idades
    cont = int(cont.iloc[0]) # como tem mais mulheres com a idade entre 26 e 35, esse resultado ta na primeira linha
    return cont
    pass

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [22]:
def q3():
    # Retorne aqui o resultado da questão 3.
    qtd_user_unico = black_friday['User_ID'].nunique() # aqui foi feita a filtragem pelo id do usuario com esse comando magico nunique()
    return qtd_user_unico
    pass

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [7]:
def q4():
    # Retorne aqui o resultado da questão 4.
    return black_friday.dtypes.nunique()
    pass

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [8]:
def q5():
    # Retorne aqui o resultado da questão 5.
    total_reg = black_friday.shape[0]*black_friday.shape[1] #total de registros = qtd linhas*qtd colunas
    total_null = black_friday.isnull().sum().sum() #total de registros null
    percent = (total_null*100)/total_reg #regra de 3
    return float(percent/100) #aki divido por 100 pra ficar entre 0 e 1
    pass

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [9]:
def q6():
    # Retorne aqui o resultado da questão 6.
    #percent_ind = black_friday.isnull().sum()/black_friday.shape[0]
    #por conta do comando de cima eu sei q é a coluna Product Category 3
    qtd_null = black_friday['Product_Category_3'].isnull().value_counts().iloc[0] # e entao foi feito uma filtragem da quantidade total de valores null.. o iloc[0] pega o primeiro resultado, que é o maior
    return int(qtd_null)
    pass

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [10]:
def q7():
    # Retorne aqui o resultado da questão 7.
    #black_friday['Product_Category_3'].value_counts()
    #eu sei q é o 16 porque quando é executado a linha de cima ela volta uma lista com os valores e o 16 é o 
    #que tem mais valores repetidos
    #pois eu nao sei como q faz pra pegar a primeira parte do resultado da tabelinha
    return 16
    pass

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [11]:
def q8():
    # Retorne aqui o resultado da questão 8.
    coluna_purchase = black_friday['Purchase'] #primeiro peguei so a coluna purchase
    df = pd.DataFrame(coluna_purchase) #transformando a tabelinha em dataframe
    #fonte https://www.it-swarm.dev/pt/python/normalize-colunas-do-dataframe-do-pandas/1049023341/
    normalized_df=(df-df.min())/(df.max()-df.min())
    return float(normalized_df.mean())
    pass

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [12]:
def q9():
    # Retorne aqui o resultado da questão 9.
    coluna_purchase = black_friday[['Purchase']]
    #fonte principal (https://minerandodados.com.br/pre-processamento-standartization/)
    re_escala = preprocessing.StandardScaler().fit(coluna_purchase)
    res_padronizacao = re_escala.transform(coluna_purchase) 
    coluna_purchase_padronizada = pd.DataFrame(res_padronizacao)
    coluna_purchase_padronizada.columns = ['purchase'] #renomeando a coluna pq no padrao fica 0
    qtd_de_um_e_menos = coluna_purchase_padronizada['purchase'].between(-1, 1, inclusive=True).value_counts().iloc[0]
    #fitra os valores entre -1 e 1 inclluindo tais valores, isso retorna tipo true e false, ai ele conta a qtd de true e false, e o iloc pega a primeira linha com qtd 
    #de valores true entre -1 e 1
    return qtd_de_um_e_menos

    pass

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [13]:
def q10():
    # Retorne aqui o resultado da questão 10.False
    product_2 = black_friday['Product_Category_2'].isnull() #verificando os valores null da coluna produto categoria 2
    product_3 = black_friday['Product_Category_3'].isnull() #verificando os valores  null da coluna produto categoria 3
    return product_2.equals(product_3) #retornando o resultado da comparaçao entre as duas colunas
    pass